GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sfspi.c
/*
 * Copyright (c) 2017-2021 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "armv7m.h"
#include "stm32wb_gpio.h"
#include "stm32wb_sfspi.h"
#include "stm32wb_sflash.h"
#include "stm32wb_system.h"

#define STM32WB_SFSPI_INSN_WRSR                  0x01
#define STM32WB_SFSPI_INSN_PAGE_PROGRAM          0x02
#define STM32WB_SFSPI_INSN_READ                  0x03 /* up to 33MHz SPI clock */
#define STM32WB_SFSPI_INSN_FAST_READ             0x0b
#define STM32WB_SFSPI_INSN_RDSR                  0x05
#define STM32WB_SFSPI_INSN_WREN                  0x06
#define STM32WB_SFSPI_INSN_RES                   0x90
#define STM32WB_SFSPI_INSN_RDID                  0x9f
#define STM32WB_SFSPI_INSN_SECTOR_ERASE          0x20 /* 4k ERASE */
#define STM32WB_SFSPI_INSN_BLOCK_ERASE           0xd8 /* 64K ERASE */

#define STM32WB_SFSPI_SR_WIP                     0x01 /* write in progress */
#define STM32WB_SFSPI_SR_WEL                     0x02 /* write enable latch */

#define STM32WB_SFSPI_MID_SPANSION               0x01
#define STM32WB_SFSPI_MID_MACRONIX               0xc2
#define STM32WB_SFSPI_MID_WINBOND                0xef

/* MACRONIX */
#define STM32WB_SFSPI_INSN_RDCONF                0x15
#define STM32WB_SFSPI_INSN_RDSCUR                0x2b
#define STM32WB_SFSPI_INSN_WRSCUR                0x2f
#define STM32WB_SFSPI_INSN_WREAR                 0xc5
#define STM32WB_SFSPI_INSN_PERSUS                0xb0
#define STM32WB_SFSPI_INSN_PERRSM                0x30
#define STM32WB_SFSPI_INSN_RSTEN                 0x66
#define STM32WB_SFSPI_INSN_RST                   0x99
#define STM32WB_SFSPI_INSN_RDPD                  0xab
#define STM32WB_SFSPI_INSN_DPD                   0xb9
#define STM32WB_SFSPI_INSN_EN4B                  0xb7
#define STM32WB_SFSPI_INSN_EX4B                  0xe9

#define STM32WB_SFSPI_SR_QE                      0x40
#define STM32WB_SFSPI_CONF2_HPM                  0x02
#define STM32WB_SFSPI_SCUR_PSB                   0x08
#define STM32WB_SFSPI_SCUR_ESB                   0x10
#define STM32WB_SFSPI_SCUR_P_FAIL                0x20
#define STM32WB_SFSPI_SCUR_E_FAIL                0x40

/* SPANSION */
#define STM32WB_SFSPI_INSN_RDSR2                 0x07
#define STM32WB_SFSPI_INSN_RDCR                  0x35
#define STM32WB_SFSPI_INSN_CLSR                  0x30
#define STM32WB_SFSPI_INSN_BRWR                  0x17
#define STM32WB_SFSPI_INSN_ERSP                  0x75
#define STM32WB_SFSPI_INSN_ERRS                  0x7a
#define STM32WB_SFSPI_INSN_PGSP                  0x85
#define STM32WB_SFSPI_INSN_PGRS                  0x8a
#define STM32WB_SFSPI_INSN_RESET                 0xf0

#define STM32WB_SFSPI_SR_P_ERR                   0x40
#define STM32WB_SFSPI_SR_E_ERR                   0x20
#define STM32WB_SFSPI_CR_QE                      0x02
#define STM32WB_SFSPI_SR2_PS                     0x01
#define STM32WB_SFSPI_SR2_ES                     0x02

#define STM32WB_SFSPI_BR_EXTADD                  0x80

/* WINBOND */
#define STM32WB_SFSPI_INSN_WREN_VOLATILE         0x50
#define STM32WB_SFSPI_INSN_WREAR                 0xc5
#define STM32WB_SFSPI_INSN_EPS                   0x75
#define STM32WB_SFSPI_INSN_EPR                   0x7a
#define STM32WB_SFSPI_INSN_RSTEN                 0x66
#define STM32WB_SFSPI_INSN_RST                   0x99
#define STM32WB_SFSPI_INSN_RDPD                  0xab
#define STM32WB_SFSPI_INSN_DPD                   0xb9
#define STM32WB_SFSPI_INSN_EN4B                  0xb7
#define STM32WB_SFSPI_INSN_EX4B                  0xe9

#define STM32WB_SFSPI_SR2_QE                     0x02
#define STM32WB_SFSPI_SR2_SUS                    0x80

#define STM32WB_SFSPI_STATE_NONE                 0
#define STM32WB_SFSPI_STATE_NOT_READY            1
#define STM32WB_SFSPI_STATE_READY                2
#define STM32WB_SFSPI_STATE_DATA                 3

#define STM32WB_SFSPI_BUSY_ERASE                 0x01
#define STM32WB_SFSPI_BUSY_PROGRAM               0x02
#define STM32WB_SFSPI_BUSY_SLEEP                 0x04
#define STM32WB_SFSPI_BUSY_SUSPENDED_ERASE       0x08
#define STM32WB_SFSPI_BUSY_SUSPENDED_PROGRAM     0x10

typedef struct _stm32wb_sfspi_device_t {
    stm32wb_spi_t                  *spi;
    volatile uint8_t               state;
    uint8_t                        busy;
    stm32wb_sfspi_pins_t           pins; 
    stm32wb_sflash_info_t          info;
    stm32wb_system_notify_t        notify;
    SPI_TypeDef                    *SPI;
    GPIO_TypeDef                   *GPIO;
    uint16_t                       mask;
    uint8_t                        address;
    uint32_t                       clock;
    uint8_t                        insn_erase_suspend;
    uint8_t                        insn_erase_resume;
    uint8_t                        insn_program_suspend;
    uint8_t                        insn_program_resume;
    volatile uint8_t               *p_status_return;
} stm32wb_sfspi_device_t;

static stm32wb_sfspi_device_t stm32wb_sfspi_device;

