GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sfspi.c
static void stm32wb_sfspi_status(uint8_t status);
static bool stm32wb_sfspi_busy(void);

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfspi_command(uint8_t insn)
{
    SPI_TypeDef *SPI = stm32wb_sfspi_device.SPI;
    
    stm32wb_sfspi_device.GPIO->BRR = stm32wb_sfspi_device.mask;
    STM32WB_SPI_DATA_8(SPI, insn);
    stm32wb_sfspi_device.GPIO->BSRR = stm32wb_sfspi_device.mask;
}

static inline __attribute__((optimize("O3"),always_inline)) uint8_t stm32wb_sfspi_command_read_1(uint8_t insn)
{
    SPI_TypeDef *SPI = stm32wb_sfspi_device.SPI;
    uint8_t data_0;

    stm32wb_sfspi_device.GPIO->BRR = stm32wb_sfspi_device.mask;
    STM32WB_SPI_DATA_8(SPI, insn);
    data_0 = STM32WB_SPI_DATA_8(SPI, 0xff);
    stm32wb_sfspi_device.GPIO->BSRR = stm32wb_sfspi_device.mask;

    return data_0;
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfspi_command_read_2(uint8_t insn, uint8_t *p_data_0, uint8_t *p_data_1)
{
    SPI_TypeDef *SPI = stm32wb_sfspi_device.SPI;

    stm32wb_sfspi_device.GPIO->BRR = stm32wb_sfspi_device.mask;
    STM32WB_SPI_DATA_8(SPI, insn);
    *p_data_0 = STM32WB_SPI_DATA_8(SPI, 0xff);
    *p_data_1 = STM32WB_SPI_DATA_8(SPI, 0xff);
    stm32wb_sfspi_device.GPIO->BSRR = stm32wb_sfspi_device.mask;
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfspi_command_read_3(uint8_t insn, uint8_t *p_data_0, uint8_t *p_data_1, uint8_t *p_data_2)
{
    SPI_TypeDef *SPI = stm32wb_sfspi_device.SPI;

    stm32wb_sfspi_device.GPIO->BRR = stm32wb_sfspi_device.mask;
    STM32WB_SPI_DATA_8(SPI, insn);
    *p_data_0 = STM32WB_SPI_DATA_8(SPI, 0xff);
    *p_data_1 = STM32WB_SPI_DATA_8(SPI, 0xff);
    *p_data_2 = STM32WB_SPI_DATA_8(SPI, 0xff);
    stm32wb_sfspi_device.GPIO->BSRR = stm32wb_sfspi_device.mask;
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfspi_command_write_1(uint8_t insn, uint8_t data_0)
{
    SPI_TypeDef *SPI = stm32wb_sfspi_device.SPI;

    stm32wb_sfspi_device.GPIO->BRR = stm32wb_sfspi_device.mask;
    STM32WB_SPI_DATA_8(SPI, insn);
    STM32WB_SPI_DATA_8(SPI, data_0);
    stm32wb_sfspi_device.GPIO->BSRR = stm32wb_sfspi_device.mask;
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfspi_command_write_2(uint8_t insn, uint8_t data_0, uint8_t data_1)
{
    SPI_TypeDef *SPI = stm32wb_sfspi_device.SPI;

    stm32wb_sfspi_device.GPIO->BRR = stm32wb_sfspi_device.mask;
    STM32WB_SPI_DATA_8(SPI, insn);
    STM32WB_SPI_DATA_8(SPI, data_0);
    STM32WB_SPI_DATA_8(SPI, data_1);
    stm32wb_sfspi_device.GPIO->BSRR = stm32wb_sfspi_device.mask;
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfspi_command_write_3(uint8_t insn, uint8_t data_0, uint8_t data_1, uint8_t data_2)
{
    SPI_TypeDef *SPI = stm32wb_sfspi_device.SPI;

    stm32wb_sfspi_device.GPIO->BRR = stm32wb_sfspi_device.mask;
    STM32WB_SPI_DATA_8(SPI, insn);
    STM32WB_SPI_DATA_8(SPI, data_0);
    STM32WB_SPI_DATA_8(SPI, data_1);
    STM32WB_SPI_DATA_8(SPI, data_2);
    stm32wb_sfspi_device.GPIO->BSRR = stm32wb_sfspi_device.mask;
}

static inline __attribute__((optimize("O3"),always_inline)) uint8_t stm32wb_sfspi_command_signature(void)
{
    SPI_TypeDef *SPI = stm32wb_sfspi_device.SPI;
    uint8_t signature;
    
    stm32wb_sfspi_device.GPIO->BRR = stm32wb_sfspi_device.mask;
    STM32WB_SPI_DATA_8(SPI, STM32WB_SFSPI_INSN_RES);
    STM32WB_SPI_DATA_8(SPI, 0x00);
    STM32WB_SPI_DATA_8(SPI, 0x00);
    STM32WB_SPI_DATA_8(SPI, 0x00);
    signature = STM32WB_SPI_DATA_8(SPI, 0xff);
    stm32wb_sfspi_device.GPIO->BSRR = stm32wb_sfspi_device.mask;

    return signature;
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfspi_command_erase(uint32_t address)
{
    SPI_TypeDef *SPI = stm32wb_sfspi_device.SPI;

    stm32wb_sfspi_device.GPIO->BRR = stm32wb_sfspi_device.mask;
    STM32WB_SPI_DATA_8(SPI, ((address < 0x00010000) ? STM32WB_SFSPI_INSN_SECTOR_ERASE : STM32WB_SFSPI_INSN_BLOCK_ERASE));
    STM32WB_SPI_DATA_8(SPI, (address >> 16));
    STM32WB_SPI_DATA_8(SPI, (address >> 8));
    STM32WB_SPI_DATA_8(SPI, (address >> 0));
    stm32wb_sfspi_device.GPIO->BSRR = stm32wb_sfspi_device.mask;
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfspi_command_program(uint32_t address, const uint8_t *data, uint32_t count)
{
    SPI_TypeDef *SPI = stm32wb_sfspi_device.SPI;
    
    stm32wb_sfspi_device.GPIO->BRR = stm32wb_sfspi_device.mask;
    STM32WB_SPI_DATA_8(SPI, STM32WB_SFSPI_INSN_PAGE_PROGRAM);
    STM32WB_SPI_DATA_8(SPI, (address >> 16));
    STM32WB_SPI_DATA_8(SPI, (address >> 8));
    STM32WB_SPI_DATA_8(SPI, (address >> 0));
    stm32wb_spi_data_transmit(stm32wb_sfspi_device.spi, data, count);
    stm32wb_sfspi_device.GPIO->BSRR = stm32wb_sfspi_device.mask;
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfspi_command_read(uint32_t address, uint8_t *data, uint32_t count)
{
    SPI_TypeDef *SPI = stm32wb_sfspi_device.SPI;

    stm32wb_sfspi_device.GPIO->BRR = stm32wb_sfspi_device.mask;
    STM32WB_SPI_DATA_8(SPI, STM32WB_SFSPI_INSN_READ);
    STM32WB_SPI_DATA_8(SPI, (address >> 16));
    STM32WB_SPI_DATA_8(SPI, (address >> 8));
    STM32WB_SPI_DATA_8(SPI, (address >> 0));
    stm32wb_spi_data_receive(stm32wb_sfspi_device.spi, data, count);
    stm32wb_sfspi_device.GPIO->BSRR = stm32wb_sfspi_device.mask;
}

static __attribute__((optimize("O3"),noinline)) uint8_t stm32wb_sfspi_write_enable(void)
{
    uint8_t status;

    do
    {
	stm32wb_sfspi_command(STM32WB_SFSPI_INSN_WREN);

	status = stm32wb_sfspi_command_read_1(STM32WB_SFSPI_INSN_RDSR);
    }
    while (!(status & STM32WB_SFSPI_SR_WEL));

    return status;
}

static __attribute__((optimize("O3"),noinline)) void stm32wb_sfspi_address(uint32_t address)
{
    if (stm32wb_sfspi_device.address != (address >> 24))
    {
	stm32wb_sfspi_device.address = (address >> 24);
	
	if (stm32wb_sfspi_device.info.mid == STM32WB_SFSPI_MID_WINBOND)
	{
	    stm32wb_sfspi_command(STM32WB_SFSPI_INSN_WREN_VOLATILE);
	}
	
	stm32wb_sfspi_command_write_1(STM32WB_SFSPI_INSN_WREAR, stm32wb_sfspi_device.address);
    }
}

static bool stm32wb_sfspi_acquire(void)
{
    if (stm32wb_sfspi_device.state < STM32WB_SFSPI_STATE_NOT_READY)
    {
	return false;
    }

    if (!stm32wb_spi_acquire(stm32wb_sfspi_device.spi, stm32wb_sfspi_device.clock, 0))
    {
	return false;
    }

