GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sfspi.c
    if (stm32wb_sfspi_device.busy & STM32WB_SFSPI_BUSY_SLEEP)
    {
        stm32wb_sfspi_command(STM32WB_SFSPI_INSN_RDPD);
        
        armv7m_core_udelay(50);

	stm32wb_sfspi_device.busy &= ~STM32WB_SFSPI_BUSY_SLEEP;
    }
    
    if (stm32wb_sfspi_device.state != STM32WB_SFSPI_STATE_NOT_READY)
    {
	stm32wb_sfspi_device.state = STM32WB_SFSPI_STATE_DATA;
    }

    return true;
}

static bool stm32wb_sfspi_release(void)
{
    if (stm32wb_sfspi_device.state < STM32WB_SFSPI_STATE_NOT_READY)
    {
	return false;
    }

    if (stm32wb_sfspi_device.state != STM32WB_SFSPI_STATE_NOT_READY)
    {
	stm32wb_sfspi_device.state = STM32WB_SFSPI_STATE_READY;
    }

    stm32wb_spi_release(stm32wb_sfspi_device.spi);
    
    return true;
}

static void stm32wb_sfspi_sleep(void)
{
    bool success;
    
    if (stm32wb_sfspi_device.state != STM32WB_SFSPI_STATE_READY)
    {
	return;
    }

    if (stm32wb_sfspi_device.busy & STM32WB_SFSPI_BUSY_SLEEP)
    {
	return;
    }

    if (stm32wb_sfspi_device.info.mid == STM32WB_SFSPI_MID_SPANSION)
    {
	return;
    }

    if (!stm32wb_sfspi_acquire())
    {
	return;
    }

    success = true;
    
    if (stm32wb_sfspi_busy())
    {
	success = false;
    }

    if (success)
    {
	stm32wb_sfspi_command(STM32WB_SFSPI_INSN_DPD);

	stm32wb_sfspi_device.busy |= STM32WB_SFSPI_BUSY_SLEEP;
    }
    
    stm32wb_sfspi_release();
}

static __attribute__((optimize("O3"),noinline)) void stm32wb_sfspi_status(uint8_t status)
{
    uint8_t scur;
    bool success;
    
    success = true;

    if (stm32wb_sfspi_device.info.mid == STM32WB_SFSPI_MID_MACRONIX)
    {
	scur = stm32wb_sfspi_command_read_1(STM32WB_SFSPI_INSN_RDSCUR);

	if (stm32wb_sfspi_device.busy & STM32WB_SFSPI_BUSY_ERASE)
	{
	    if (scur & STM32WB_SFSPI_SCUR_E_FAIL)
	    {
		success = false;
	    }
	}
	else
	{
	    if (scur & STM32WB_SFSPI_SCUR_P_FAIL)
	    {
		success = false;
	    }
	}
    }
    
    if (stm32wb_sfspi_device.info.mid == STM32WB_SFSPI_MID_SPANSION)
    {
	if (status & (STM32WB_SFSPI_SR_E_ERR | STM32WB_SFSPI_SR_P_ERR))
	{
	    stm32wb_sfspi_command(STM32WB_SFSPI_INSN_CLSR);
	    
	    success = false;
	}
    }
    
    if (stm32wb_sfspi_device.p_status_return)
    {
	*stm32wb_sfspi_device.p_status_return = success ? STM32WB_SFLASH_STATUS_SUCCESS : STM32WB_SFLASH_STATUS_FAILURE;
    }
    
    stm32wb_sfspi_device.busy &= ~(STM32WB_SFSPI_BUSY_ERASE | STM32WB_SFSPI_BUSY_PROGRAM);
}

static __attribute__((optimize("O3"),noinline)) bool stm32wb_sfspi_busy(void)
{
    uint8_t status;
    
    if (stm32wb_sfspi_device.state != STM32WB_SFSPI_STATE_DATA)
    {
	return false;
    }

    if (!(stm32wb_sfspi_device.busy & (STM32WB_SFSPI_BUSY_ERASE | STM32WB_SFSPI_BUSY_PROGRAM)))
    {
	return false;
    }

    status = stm32wb_sfspi_command_read_1(STM32WB_SFSPI_INSN_RDSR);

    if (status & (STM32WB_SFSPI_SR_WEL | STM32WB_SFSPI_SR_WIP))
    {
	return true;
    }

    stm32wb_sfspi_status(status);

    return false;
}

static bool stm32wb_sfspi_suspend(void)
{
    uint8_t status, status2, scur;
    bool success;
    
    if (stm32wb_sfspi_device.state != STM32WB_SFSPI_STATE_DATA)
    {
	return false;
    }

    if (stm32wb_sfspi_device.busy & (STM32WB_SFSPI_BUSY_SUSPENDED_ERASE | STM32WB_SFSPI_BUSY_SUSPENDED_PROGRAM))
    {
	return false;
    }
    
    if (!stm32wb_sfspi_busy())
    {
	return false;
    }
    
    stm32wb_sfspi_command((stm32wb_sfspi_device.busy & STM32WB_SFSPI_BUSY_ERASE) ? stm32wb_sfspi_device.insn_erase_suspend : stm32wb_sfspi_device.insn_program_suspend);

    do
    {
	status = stm32wb_sfspi_command_read_1(STM32WB_SFSPI_INSN_RDSR);
    }
    while (status & (STM32WB_SFSPI_SR_WEL | STM32WB_SFSPI_SR_WIP));

    success = true;

    if (stm32wb_sfspi_device.info.mid == STM32WB_SFSPI_MID_SPANSION)
    {
	status2 = stm32wb_sfspi_command_read_1(STM32WB_SFSPI_INSN_RDSR2);
	
	if (!(status2 & (STM32WB_SFSPI_SR2_ES | STM32WB_SFSPI_SR2_PS)))
	{
	    success = false;
	}
    }
    
    if (stm32wb_sfspi_device.info.mid == STM32WB_SFSPI_MID_MACRONIX)
    {
	scur = stm32wb_sfspi_command_read_1(STM32WB_SFSPI_INSN_RDSCUR);
	
	if (!(scur & (STM32WB_SFSPI_SCUR_ESB | STM32WB_SFSPI_SCUR_PSB)))
	{
	    success = false;
	}
    }

    if (stm32wb_sfspi_device.info.mid == STM32WB_SFSPI_MID_WINBOND)
    {
	stm32wb_sfspi_command_read_2(STM32WB_SFSPI_INSN_RDSR, &status, &status2);

	if (!(status2 & STM32WB_SFSPI_SR2_SUS))
	{
	    success = false;
	}
    }
    
    if (success)
    {
	if (stm32wb_sfspi_device.busy & STM32WB_SFSPI_BUSY_ERASE)
	{
	    stm32wb_sfspi_device.busy = (stm32wb_sfspi_device.busy & ~STM32WB_SFSPI_BUSY_ERASE) | STM32WB_SFSPI_BUSY_SUSPENDED_ERASE;
	}
	else
	{
	    stm32wb_sfspi_device.busy = (stm32wb_sfspi_device.busy & ~STM32WB_SFSPI_BUSY_PROGRAM) | STM32WB_SFSPI_BUSY_SUSPENDED_PROGRAM;
	}

	return true;
    }
    else
    {
	stm32wb_sfspi_status(status);

	return false;
    }
}

static bool stm32wb_sfspi_resume(void)
{
    if (stm32wb_sfspi_device.state != STM32WB_SFSPI_STATE_DATA)
    {
	return false;
    }

    if (!(stm32wb_sfspi_device.busy & (STM32WB_SFSPI_BUSY_SUSPENDED_ERASE | STM32WB_SFSPI_BUSY_SUSPENDED_PROGRAM)))
    {
	return false;
    }
    
    stm32wb_sfspi_command((stm32wb_sfspi_device.busy & STM32WB_SFSPI_BUSY_SUSPENDED_ERASE) ? stm32wb_sfspi_device.insn_erase_resume : stm32wb_sfspi_device.insn_program_resume);
    
    if (stm32wb_sfspi_device.busy & STM32WB_SFSPI_BUSY_SUSPENDED_PROGRAM)
    {
	stm32wb_sfspi_device.busy = (stm32wb_sfspi_device.busy & ~STM32WB_SFSPI_BUSY_SUSPENDED_PROGRAM) | STM32WB_SFSPI_BUSY_PROGRAM;
    }
    else
    {
	stm32wb_sfspi_device.busy = (stm32wb_sfspi_device.busy & ~STM32WB_SFSPI_BUSY_SUSPENDED_ERASE) | STM32WB_SFSPI_BUSY_ERASE;
    }
    
    return true;
}

static bool stm32wb_sfspi_erase(uint32_t address, volatile uint8_t *p_status_return)
{
    if (stm32wb_sfspi_device.state != STM32WB_SFSPI_STATE_DATA)
    {
	return false;
    }

    if (stm32wb_sfspi_device.busy & (STM32WB_SFSPI_BUSY_SUSPENDED_ERASE | STM32WB_SFSPI_BUSY_SUSPENDED_PROGRAM | STM32WB_SFSPI_BUSY_ERASE | STM32WB_SFSPI_BUSY_PROGRAM))
    {
	return false;
    }

