GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sfspi.c
    if (p_status_return)
    {
	*p_status_return = STM32WB_SFLASH_STATUS_BUSY;
    }
    
    stm32wb_sfspi_device.p_status_return = p_status_return;
    stm32wb_sfspi_device.busy = STM32WB_SFSPI_BUSY_ERASE;
    
    if (stm32wb_sfspi_device.info.capacity > 0x01000000)
    {
	stm32wb_sfspi_address(address);
    }
    
    stm32wb_sfspi_write_enable();

    stm32wb_sfspi_command_erase(address);
    
    return true;
}

static __attribute__((optimize("O3"),noinline)) bool stm32wb_sfspi_program(uint32_t address, const uint8_t *data, uint32_t count, volatile uint8_t *p_status_return)
{
    if (stm32wb_sfspi_device.state != STM32WB_SFSPI_STATE_DATA)
    {
	return false;
    }

    if (stm32wb_sfspi_device.busy & (STM32WB_SFSPI_BUSY_SUSPENDED_ERASE | STM32WB_SFSPI_BUSY_SUSPENDED_PROGRAM | STM32WB_SFSPI_BUSY_ERASE | STM32WB_SFSPI_BUSY_PROGRAM))
    {
	return false;
    }
    
    if (p_status_return)
    {
	*p_status_return = STM32WB_SFLASH_STATUS_BUSY;
    }
    
    stm32wb_sfspi_device.p_status_return = p_status_return;
    stm32wb_sfspi_device.busy = STM32WB_SFSPI_BUSY_PROGRAM;

    if (stm32wb_sfspi_device.info.capacity > 0x01000000)
    {
	stm32wb_sfspi_address(address);
    }

    stm32wb_sfspi_write_enable();

    stm32wb_sfspi_command_program(address, data, count);
    
    return true;
}

static __attribute__((optimize("O3"),noinline)) bool stm32wb_sfspi_read(uint32_t address, uint8_t *data, uint32_t count)
{
    if (stm32wb_sfspi_device.state != STM32WB_SFSPI_STATE_DATA)
    {
	return false;
    }

    if (stm32wb_sfspi_device.busy & (STM32WB_SFSPI_BUSY_ERASE | STM32WB_SFSPI_BUSY_PROGRAM))
    {
	return false;
    }

    if (stm32wb_sfspi_device.info.capacity > 0x01000000)
    {
	stm32wb_sfspi_address(address);
    }
    
    stm32wb_sfspi_command_read(address, data, count);
    
    return true;
}

static const stm32wb_sflash_interface_t stm32wb_sfspi_interface = {
    stm32wb_sfspi_acquire,
    stm32wb_sfspi_release,
    stm32wb_sfspi_busy,
    stm32wb_sfspi_suspend,
    stm32wb_sfspi_resume,
    stm32wb_sfspi_erase,
    stm32wb_sfspi_program,
    stm32wb_sfspi_read,
};

bool stm32wb_sfspi_initialize(stm32wb_spi_t *spi, const stm32wb_sfspi_params_t *params)
{
    uint32_t group, index;
    uint8_t MID, DID[2], status;
    bool success;
    
    if (stm32wb_sfspi_device.state != STM32WB_SFSPI_STATE_NONE)
    {
	return false;
    }
    
    if (spi->state == STM32WB_SPI_STATE_NONE)
    {
	return false;
    }

    stm32wb_sfspi_device.state = STM32WB_SFSPI_STATE_NOT_READY;
	
    stm32wb_sfspi_device.spi = spi;
    stm32wb_sfspi_device.pins = params->pins;

    stm32wb_sfspi_device.SPI = spi->SPI;

    group = (params->pins.cs & STM32WB_GPIO_PIN_GROUP_MASK) >> STM32WB_GPIO_PIN_GROUP_SHIFT;
    index = (params->pins.cs & STM32WB_GPIO_PIN_INDEX_MASK) >> STM32WB_GPIO_PIN_INDEX_SHIFT;
        
    stm32wb_sfspi_device.GPIO = (GPIO_TypeDef *)(GPIOA_BASE + (GPIOB_BASE - GPIOA_BASE) * group);
    stm32wb_sfspi_device.mask = (1 << index);

    stm32wb_sfspi_device.clock = 8000000;
    
    stm32wb_gpio_pin_configure(stm32wb_sfspi_device.pins.cs, (STM32WB_GPIO_PARK_PULLUP | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_OUTPUT));
    stm32wb_gpio_pin_write(stm32wb_sfspi_device.pins.cs, 1);

    stm32wb_spi_enable(spi); // bump up refcount
    
    stm32wb_sfspi_acquire();
    
    stm32wb_sfspi_command(STM32WB_SFSPI_INSN_RDPD);
    
    armv7m_core_udelay(200);

    stm32wb_sfspi_device.info.mid = stm32wb_sfspi_command_signature();

    success = false;

    if (stm32wb_sfspi_device.info.mid == STM32WB_SFSPI_MID_SPANSION)
    {
	success = true;
    }
    
    if (stm32wb_sfspi_device.info.mid == STM32WB_SFSPI_MID_MACRONIX)
    {
	success = true;
    }

    if (stm32wb_sfspi_device.info.mid == STM32WB_SFSPI_MID_WINBOND)
    {
	success = true;
    }

    if (success)
    {
	status = stm32wb_sfspi_command_read_1(STM32WB_SFSPI_INSN_RDSR);
	
	if (status & (STM32WB_SFSPI_SR_WEL | STM32WB_SFSPI_SR_WIP))
	{
	    if (stm32wb_sfspi_device.info.mid == STM32WB_SFSPI_MID_SPANSION)
	    {
		stm32wb_sfspi_command(STM32WB_SFSPI_INSN_RESET);
	    }
	    else
	    {
		stm32wb_sfspi_command(STM32WB_SFSPI_INSN_RSTEN);
		stm32wb_sfspi_command(STM32WB_SFSPI_INSN_RST);
	    }
	    
	    armv7m_core_udelay(100);
	    
	    do
	    {
		status = stm32wb_sfspi_command_read_1(STM32WB_SFSPI_INSN_RDSR);
	    } 
	    while (status & (STM32WB_SFSPI_SR_WEL | STM32WB_SFSPI_SR_WIP));
	}

	stm32wb_sfspi_command_read_3(STM32WB_SFSPI_INSN_RDID, &MID, &DID[0], &DID[1]);

	if ((stm32wb_sfspi_device.info.mid != MID) || ((DID[0] == 0x00) && (DID[1] == 0x00)) || ((DID[0] == 0xff) && (DID[1] == 0xff)))
	{
	    success = false;
	}
    }

    if (success)
    {
        stm32wb_sfspi_device.info.did = (DID[0] << 8) | (DID[1] << 0);
        stm32wb_sfspi_device.info.capacity = (1 << DID[1]);
        stm32wb_sfspi_device.info.block_size = 65536;
        stm32wb_sfspi_device.info.page_size = 256;

	stm32wb_sfspi_device.clock = 32000000;

	if (MID == STM32WB_SFSPI_MID_SPANSION)
	{
	    stm32wb_sfspi_device.insn_erase_suspend = STM32WB_SFSPI_INSN_ERSP;
	    stm32wb_sfspi_device.insn_erase_resume = STM32WB_SFSPI_INSN_ERRS;
	    stm32wb_sfspi_device.insn_program_suspend = STM32WB_SFSPI_INSN_PGSP;
	    stm32wb_sfspi_device.insn_program_resume = STM32WB_SFSPI_INSN_PGRS;
	}

	if (MID == STM32WB_SFSPI_MID_MACRONIX)
	{
	    stm32wb_sfspi_device.insn_erase_suspend = STM32WB_SFSPI_INSN_PERSUS;
	    stm32wb_sfspi_device.insn_erase_resume = STM32WB_SFSPI_INSN_PERRSM;
	    stm32wb_sfspi_device.insn_program_suspend = STM32WB_SFSPI_INSN_PERSUS;
	    stm32wb_sfspi_device.insn_program_resume = STM32WB_SFSPI_INSN_PERRSM;
	}

	if (MID == STM32WB_SFSPI_MID_WINBOND)
	{
	    stm32wb_sfspi_device.insn_erase_suspend = STM32WB_SFSPI_INSN_EPS;
	    stm32wb_sfspi_device.insn_erase_resume = STM32WB_SFSPI_INSN_EPR;
	    stm32wb_sfspi_device.insn_program_suspend = STM32WB_SFSPI_INSN_EPS;
	    stm32wb_sfspi_device.insn_program_resume = STM32WB_SFSPI_INSN_EPR;
	}
	
	if (stm32wb_sfspi_device.info.capacity > 0x01000000)
	{
	    stm32wb_sfspi_device.address = 0xff;

	    stm32wb_sfspi_address(0x00000000);
	}

	stm32wb_sfspi_release();
    
	stm32wb_sfspi_device.state = STM32WB_SFSPI_STATE_READY;

	stm32wb_system_register(&stm32wb_sfspi_device.notify, (stm32wb_system_callback_t)stm32wb_sfspi_sleep, NULL, STM32WB_SYSTEM_NOTIFY_SLEEP);
	
	__stm32wb_sflash_initialize(&stm32wb_sfspi_interface, &stm32wb_sfspi_device.info);
    }
    else
    {
        stm32wb_sfspi_release();

	stm32wb_spi_disable(spi);

	stm32wb_gpio_pin_configure(stm32wb_sfspi_device.pins.cs, STM32WB_GPIO_MODE_ANALOG);

	stm32wb_sfspi_device.state = STM32WB_SFSPI_STATE_NONE;
    }

    return success;
}
